Revit 2027 API
PanelScheduleData.IsSummarySectionHidden Property
 True if the user wishes to hide the summary section; setting this value must go through the appropriate update function
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSummarySectionHidden { get; }
Public ReadOnly Property IsSummarySectionHidden As Boolean
	Get
public:
property bool IsSummarySectionHidden {
	bool get ();
}
member IsSummarySectionHidden : bool with get
Property Value
Boolean
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace